{"tool":"nessus","param":"Web App Tests","date":"0","vulnerabilities":[{"host":"preprod.boardvantage.net","service":"0/tcp","risk":"Nessus Scan Information","type":"Nessus Scan Information","description":"This script displays, for each tested host, information about the scan itself :\n\n - The version of the plugin set\n - The type of plugin feed (HomeFeed or ProfessionalFeed)\n - The version of the Nessus Engine\n - The port scanner(s) used\n - The port range scanned\n - Whether credentialed or third-party patch management    checks are possible\n - The date of the scan\n - The duration of the scan\n - The number of hosts scanned in parallel\n - The number of checks done in parallel Information about the Nessus scan.","id_cve":[],"refs":[],"solution":"n/a"},{"host":"preprod.boardvantage.net","service":"0/tcp","risk":"Device Type","type":"Device Type","description":"Based on the remote operating system, it is possible to determine what the remote system type is (eg: a printer, router, general-purpose computer, etc). It is possible to guess the remote device type.","id_cve":[],"refs":[],"solution":"n/a"},{"host":"preprod.boardvantage.net","service":"0/tcp","risk":"Common Platform Enumeration (CPE)","type":"Common Platform Enumeration (CPE)","description":"By using information obtained from a Nessus scan, this plugin reports CPE (Common Platform Enumeration) matches for various hardware and software products found on a host. \n\nNote that if an official CPE is not available for the product, this plugin computes the best possible CPE based on the information available from the scan. It is possible to enumerate CPE names that matched on the remote system.","id_cve":[],"refs":["http://cpe.mitre.org/"],"solution":"n/a"},{"host":"preprod.boardvantage.net","service":"0/tcp","risk":"OS Identification","type":"OS Identification","description":"Using a combination of remote probes (TCP/IP, SMB, HTTP, NTP, SNMP, etc...), it is possible to guess the name of the remote operating system in use. It is also sometimes possible to guess the version of the operating system. It is possible to guess the remote operating system.","id_cve":[],"refs":[],"solution":"n/a"},{"host":"preprod.boardvantage.net","service":"0/tcp","risk":"Host Fully Qualified Domain Name (FQDN) Resolution","type":"Host Fully Qualified Domain Name (FQDN) Resolution","description":"Nessus was able to resolve the FQDN of the remote host. It was possible to resolve the name of the remote host.","id_cve":[],"refs":[],"solution":"n/a"},{"host":"preprod.boardvantage.net","service":"443/https","risk":"Nessus SYN scanner","type":"Nessus SYN scanner","description":"This plugin is a SYN 'half-open' port scanner.\nIt shall be reasonably quick even against a firewalled target.\n\nNote that SYN scanners are less intrusive than TCP (full connect) scanners against broken services, but they might kill lame misconfigured firewalls. They might also leave unclosed connections on the remote target, if the network is loaded. It is possible to determine which TCP ports are open.","id_cve":[],"refs":[],"solution":"Protect your target with an IP filter."}]}